In [1]:
import pandas as pd

# q1

In [5]:
list=[4,8,12,14,36,42]

In [6]:
pd.Series(list)

0     4
1     8
2    12
3    14
4    36
5    42
dtype: int64

# q2

In [7]:
x=pd.Series(["she","is","good","girl"])

In [8]:
x

0     she
1      is
2    good
3    girl
dtype: object

# q3

In [9]:
data={"name":["alice","bob","claire"],"age":[25,30,27],"gender":["female","male","female"]}

In [10]:
df=pd.DataFrame(data)

In [11]:
df

     name  age  gender
0   alice   25  female
1     bob   30    male
2  claire   27  female

# q4

In [13]:
#DataFrame in pandas is a 2d data structure like 2d array or we can say that a table with rows and columns

In [ ]:
#series is a 1d data structure that consist of key value pAIR.it provide a  freedom to edit the data.

In [15]:
data=[1000,5677,5678]
s=pd.Series(data)
s

0    1000
1    5677
2    5678
dtype: int64

In [16]:
data=[1000,5677,5678]
s=pd.DataFrame(data)
s

      0
0  1000
1  5677
2  5678

# q5

In [19]:
df=pd.read_csv("data.csv")

In [20]:
df

      name  rollno  phone_no
0    kriti     678    987655
1    lalit     567     87543
2    palak     345    908543
3  kirtika     678   4678993
4    kevin     562   6754290
5   khushi     234  78123456
6    pinky     512  79873456

In [21]:
df.head()

      name  rollno  phone_no
0    kriti     678    987655
1    lalit     567     87543
2    palak     345    908543
3  kirtika     678   4678993
4    kevin     562   6754290

In [23]:
df.head(2)

    name  rollno  phone_no
0  kriti     678    987655
1  lalit     567     87543

In [24]:
df.tail(3)

     name  rollno  phone_no
4   kevin     562   6754290
5  khushi     234  78123456
6   pinky     512  79873456

In [27]:
type(df)

pandas.core.frame.DataFrame

In [28]:
df.dtypes

name        object
rollno       int64
phone_no     int64
dtype: object

In [29]:
df.columns

Index(['name', 'rollno', 'phone_no'], dtype='object')

In [30]:
df["name"]

0      kriti
1      lalit
2      palak
3    kirtika
4      kevin
5     khushi
6      pinky
Name: name, dtype: object

# q6

In [ ]:
series are mutable means we can chnage any value in series but the size of series is immutable.Dataframe is mutable so we can change the dat in dataframe.and the last one is panel in which dat and size bith are mutable.

# q7

In [32]:
name=pd.Series(["atul","rani","kajal"])

In [33]:
course=pd.Series(["data science","java","web app"])

In [34]:
fees=pd.Series([30000,8900,5600])

In [37]:
df=pd.concat([name,course,fees],axis=1)

In [38]:
df

       0             1      2
0   atul  data science  30000
1   rani          java   8900
2  kajal       web app   5600